# text = "Документи, мають, два види, архівного зберігання: " \
#        "постійне та тривале — 10 років і тимчасове зберігання — до 10 років. " \
#        "Документи першого типу: статути, штатні розписи, установчі документи, " \
#        "особові справи рекомендуємо зберігати в паперовій формі. Документи, " \
#        "що фіксують господарські операції: касові, банківські документи, ордери, " \
#        "кредитні договори, поруки, застави, гарантії та інші достатньо зберігати " \
#        "в електронній формі. Електронна форма також підходить для документів, " \
#        "що підлягають знищенню після закінчення терміну зберігання."
text = input("Введіть текст: ")

###   Вариант №1
count = 0
new_text = ""
for symbol in text:
    if symbol == ",":
        count += 1
        if count == 3:
            new_text += " мля,"
            count = 0
        else:
            new_text += symbol
    else:
        new_text += symbol
print(new_text)


###   вариант №2
my_list = list(text)
count = 0
for index in range(0, len(my_list)):
    if my_list[index] == ',':
        count += 1
        if count == 3:
            my_list[index] = ' мля,'
            count = 0

print(''.join(my_list))