# print('Hellow, World!')

# +-*/, // % **, += -=

# Логічні оператори: and, or, not

# num_ = int(input("vvedit chislo"))
# massage = "chet" if num_ % 2 == 0 else "nechet"
# print(massage)
#
# i = 1
# c = 0
# while i <= 100:
#     if i%5 ==0:
#         print(i)
#         c += 1
#     i += 1
#
# print()
# print(c)


name = "snow storm"
print("%s" % name[6:8])

print(5 + 10)
print(3 * 7, (17 - 2) * 8)
print(2 ** 16)  # две звезды используются для возведения в степень (2 до степени 16)
print(37 / 3)  # одиночная косая черта - это разделение
print(37 // 3)  # двойная косая черта - это целочисленное деление
        # он возвращает только фактор деления (т. е. никакого остатка)
print(37 % 1)  # знак процента - оператор модуля
        # он дает оставшуюся часть левого значения, деленное на правильное значение